In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'Salary': [50000, 60000, 70000, 80000, 90000],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'IT'],
    'Joining_Date': pd.to_datetime(['2015-03-15', '2018-07-23', '2012-09-18', '2019-11-30', '2020-01-10']),
    'Remote_Work': [True, False, False, True, True],
    'Performance_Score': [4.5, 3.8, np.nan, 4.2, 4.8],
    'Bonus': [3000, 4000, np.nan, 5000, 4500],
    'Projects_Completed': [12, 9, 15, 8, 11]
}

df = pd.DataFrame(data)
print(df)

    ID     Name  Age  Salary Department Joining_Date  Remote_Work  \
0  101    Alice   25   50000         HR   2015-03-15         True
1  102      Bob   30   60000         IT   2018-07-23        False
2  103  Charlie   35   70000    Finance   2012-09-18        False
3  104    David   40   80000  Marketing   2019-11-30         True
4  105      Eva   45   90000         IT   2020-01-10         True

   Performance_Score   Bonus  Projects_Completed
0                4.5  3000.0                  12
1                3.8  4000.0                   9
2                NaN     NaN                  15
3                4.2  5000.0                   8
4                4.8  4500.0                  11

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5 non-null      int64
 1   Name                5 non-null      object
 2   Age                 5 non-null      int64
 3   Salary              5 non-null      int64
 4   Department          5 non-null      object
 5   Joining_Date        5 non-null      datetime64[ns]
 6   Remote_Work         5 non-null      bool
 7   Performance_Score   4 non-null      float64
 8   Bonus               4 non-null      float64
 9   Projects_Completed  5 non-null      int64
dtypes: bool(1), datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 493.0+ bytes

In [4]:
df.describe()

,ID,Age,Salary,Joining_Date,Performance_Score,Bonus,Projects_Completed
count,5.000000,5.000000,5.000000,5,4.0000,4.000000,5.000000
mean,103.000000,35.000000,70000.000000,2017-04-13 04:48:00,4.3250,4125.000000,11.000000
min,101.000000,25.000000,50000.000000,2012-09-18 00:00:00,3.8000,3000.000000,8.000000
25%,102.000000,30.000000,60000.000000,2015-03-15 00:00:00,4.1000,3750.000000,9.000000
50%,103.000000,35.000000,70000.000000,2018-07-23 00:00:00,4.3500,4250.000000,11.000000
75%,104.000000,40.000000,80000.000000,2019-11-30 00:00:00,4.5750,4625.000000,12.000000
max,105.000000,45.000000,90000.000000,2020-01-10 00:00:00,4.8000,5000.000000,15.000000
std,1.581139,7.905694,15811.388301,NaN,0.4272,853.912564,2.738613

In [5]:
df.shape

(5, 10)

In [6]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['ID', 'Name', 'Age', 'Salary', 'Department', 'Joining_Date',
        'Remote_Work', 'Performance_Score', 'Bonus', 'Projects_Completed'],
       dtype='object')]

In [23]:
df.head()

,ID,Name,Age,Salary,Department,Joining_Date,Remote_Work,Performance_Score,Bonus,Projects_Completed
0,101,Alice,25,50000,HR,2015-03-15,True,4.5,3000.0,12
1,102,Bob,30,60000,IT,2018-07-23,False,3.8,4000.0,9
2,103,Charlie,35,70000,Finance,2012-09-18,False,NaN,NaN,15
3,104,David,40,80000,Marketing,2019-11-30,True,4.2,5000.0,8
4,105,Eva,45,90000,IT,2020-01-10,True,4.8,4500.0,11

In [24]:
df.tail()

,ID,Name,Age,Salary,Department,Joining_Date,Remote_Work,Performance_Score,Bonus,Projects_Completed
0,101,Alice,25,50000,HR,2015-03-15,True,4.5,3000.0,12
1,102,Bob,30,60000,IT,2018-07-23,False,3.8,4000.0,9
2,103,Charlie,35,70000,Finance,2012-09-18,False,NaN,NaN,15
3,104,David,40,80000,Marketing,2019-11-30,True,4.2,5000.0,8
4,105,Eva,45,90000,IT,2020-01-10,True,4.8,4500.0,11

In [10]:
print(df.loc[:,'Name'])
print(df.iloc[:,2])

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object
0    25
1    30
2    35
3    40
4    45
Name: Age, dtype: int64

In [21]:
value1 = df.groupby('Department').size()
value1

Department
Finance      1
HR           1
IT           2
Marketing    1
dtype: int64

In [ ]:
value2 = df.groupby('Department').count()
value2

,ID,Name,Age,Salary,Joining_Date,Remote_Work,Performance_Score,Bonus,Projects_Completed
Department,,,,,,,,,
Finance,1,1,1,1,1,1,0,0,1
HR,1,1,1,1,1,1,1,1,1
IT,2,2,2,2,2,2,2,2,2
Marketing,1,1,1,1,1,1,1,1,1

In [25]:
df['Department'].value_counts()

Department
IT           2
HR           1
Finance      1
Marketing    1
Name: count, dtype: int64

In [27]:
df['Name'].sort_values()

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [33]:
df['Bonus'].isna()

0    False
1    False
2     True
3    False
4    False
Name: Bonus, dtype: bool

In [31]:
df.groupby('Department')['Salary'].agg(['sum','min'])

               sum    min
Department
Finance      70000  70000
HR           50000  50000
IT          150000  60000
Marketing    80000  80000

In [37]:
a = df.query('ID == 101')[['Name','Age','Salary','Department']]
a

    Name  Age  Salary Department
0  Alice   25   50000         HR